read_verilog -sv top.v

hierarchy -top top

synth_ecp5 -top top -json _build/hardware.json
